RIET/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ЮридическоеЛицо</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>(Общ)</comment>
  <basedOn>Catalog.Организации</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ОсновнойДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл) Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеКонтактноеЛицо</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>LawsonID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEnglish</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionFull</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентLawson</name>
    <type>
      <types>CatalogRef.КонтрагентыLawson</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КППВведенКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасширенноеПредставлениеКПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапретаИспользования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/CommonForms/ФормаВыбораКПП/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		Отказ	= Истина;
		Возврат;
	КонецЕсли;
	
	СвойстваКонтрагента	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Контрагент, "КПП, ЮридическоеФизическоеЛицо");
	
	Если СвойстваКонтрагента.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВернутьСтр("ru ='КПП для физических лиц не задается'"), , , , Отказ);
		Отказ	= Истина;
		Возврат;
	КонецЕсли;
	
	КППКонтрагента	= Параметры.КППКонтрагента;
	ЗаполнитьСписокВыбораКППКонтрагента(СписокВыбораКПП, Параметры.Контрагент);
	Если ПустаяСтрока(КППКонтрагента) И СписокВыбораКПП.Количество() > 0 Тогда
		КППКонтрагента	= СписокВыбораКПП[0].Значение;
	КонецЕсли;
	
	ТекстПодсказки = "";
	Если Параметры.РольКонтрагента = "Поставщик" Тогда
		Заголовок	= ВернутьСтр("ru = 'КПП поставщика'");
		ТекстПодсказки = ВернутьСтр("ru = 'При приобретении товаров и услуг через обособленные подразделения контрагентов, 
			|в строке 2б ""ИНН/КПП продавца"" счета-фактуры указывается КПП соответствующего обособленного подразделения'");
	ИначеЕсли Параметры.РольКонтрагента = "Покупатель" Тогда
		Заголовок	= ВернутьСтр("ru = 'КПП покупателя'");
		ТекстПодсказки = ВернутьСтр("ru = 'При реализации товаров и услуг обособленным подразделениям контрагентов, 
			|в строке 6б ""ИНН/КПП покупателя"" счета-фактуры указывается КПП соответствующего обособленного подразделения'");
	Иначе
		Заголовок	= ВернутьСтр("ru = 'КПП контрагента'");
		Элементы.КППКонтрагента.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	Элементы.КППКонтрагента.РасширеннаяПодсказка.Заголовок = ТекстПодсказки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ВопросСохраненияДанныхЗавершение", ЭтотОбъект);
		ТекстВопроса = ВернутьСтр("ru = 'Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КППКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ДанныеВыбора = СписокВыбораКПП;
			
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбораКППКонтрагента(СписокВыбораКПП, ГоловнойКонтрагент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);

	// Первый элемент - всегда КПП головного контрагента, даже, если не задан
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты.КПП КАК КПП,
		|	Контрагенты.Представление КАК ПредставлениеКонтрагента
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &ГоловнойКонтрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.КПП,
		|	Контрагенты.Представление
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.Ссылка = &ГоловнойКонтрагент
		|	И Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
		|	И Контрагенты.ОбособленноеПодразделение
		|	И НЕ Контрагенты.ПометкаУдаления
		|	И НЕ Контрагенты.КПП ПОДОБНО """"";
	
	СписокВыбораКПП.Очистить();
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПредставлениеКПП	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 (%2)", ?(ПустаяСтрока(Выборка.КПП), "<не задан>", Выборка.КПП), Выборка.ПредставлениеКонтрагента);
		СписокВыбораКПП.Добавить(Выборка.КПП, ПредставлениеКПП);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения()
	
	Если ПроверитьЗаполнение() Тогда
		Модифицированность	= Ложь;
		
		ЗначениеВыбора	= Новый Структура("КППКонтрагента", КППКонтрагента);
			
		ОповеститьОВыборе(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьИзменения();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
